<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"baef23307e9c3172a1e73aeb02bfab18b8fc8c400e29b2f88bc233fa88b19ce3","plan_job_ref":"Job Run Terraform plan in staging #3 at https://github.com/zjrgov/my-rails-app/actions/runs/12716069392","plan_out_hash":"53656f38da399687e2b9829aebaa0009b63ac979cd8b214aa04ae1e627fdcb71","plan_hash":"31f67e6c89debcf9c808d3d485b29ddc467f13c905c1625ca86c5536949003b9","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.app will be created
+   resource "cloudfoundry_app" "app" {
+       buildpacks                  = [
+           "ruby_buildpack",
        ]
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       environment                 = {
+           "RAILS_ENV"                = "staging"
+           "RAILS_LOG_TO_STDOUT"      = "true"
+           "RAILS_MASTER_KEY"         = (sensitive value)
+           "RAILS_SERVE_STATIC_FILES" = "true"
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
+       name                        = "my_rails_app-staging"
+       org_name                    = "sandbox-gsa"
+       path                        = "./dist/src.zip"
+       processes                   = [
+           {
+               command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
+               disk_quota                  = (known after apply)
+               health_check_type           = (known after apply)
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
+       readiness_health_check_type = (known after apply)
+       routes                      = [
+           {
+               protocol = (known after apply)
+               route    = "my_rails_app-staging.app.cloud.gov"
            },
        ]
+       service_bindings            = [
+           {
+               service_instance = "my_rails_app-rds-staging"
            },
        ]
+       source_code_hash            = "EDEjTX78nSiIhnYfdHXKbq62pQxOHrOzJXEA8RhUWo0="
+       space_name                  = "zachary.rollyson"
+       stack                       = (known after apply)
+       strategy                    = "blue-green"
+       updated_at                  = (known after apply)
    }

  # module.database.cloudfoundry_service_instance.rds will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       created_at        = (known after apply)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "my_rails_app-rds-staging"
+       service_plan      = "5ed9f319-4c75-4851-9885-598a96b7febc"
+       space             = "93925f50-b328-47dc-8326-efb54e1afade"
+       tags              = [
+           "terraform-cloudgov-managed",
        ]
+       type              = "managed"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #3](https://github.com/zjrgov/my-rails-app/actions/runs/12716069392)